---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.ForwardIterator
source: html/c87bc114-edf4-56f6-5160-48d4f1d001e4.htm
---
# Autodesk.Revit.DB.ViewSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ViewSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.